pandas中文网学习记录

网址:

https://www.pypandas.cn/docs/getting_started/10min.html#生成对象

In [1]:
import numpy as np
import pandas as pd

# 生成对象
Pandas 默认自动生成整数索引

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.118245 -0.858175  0.772255  0.480990
2013-01-02  0.547917  0.772481 -1.064608  1.268746
2013-01-03 -1.394952 -1.227015 -0.907070  0.822052
2013-01-04 -0.952208  0.396895  0.106899 -1.074857
2013-01-05 -0.121886  1.143628  1.179651 -0.807081
2013-01-06  0.013189 -0.912261  0.253989 -0.305855

In [5]:
# 用 Series 字典对象生成 DataFrame:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# 查看数据

In [7]:
df.head()

                   A         B         C         D
2013-01-01 -1.118245 -0.858175  0.772255  0.480990
2013-01-02  0.547917  0.772481 -1.064608  1.268746
2013-01-03 -1.394952 -1.227015 -0.907070  0.822052
2013-01-04 -0.952208  0.396895  0.106899 -1.074857
2013-01-05 -0.121886  1.143628  1.179651 -0.807081

In [8]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.952208  0.396895  0.106899 -1.074857
2013-01-05 -0.121886  1.143628  1.179651 -0.807081
2013-01-06  0.013189 -0.912261  0.253989 -0.305855

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [11]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.504364 -0.114075  0.056853  0.063999
std    0.760527  1.005814  0.894501  0.937284
min   -1.394952 -1.227015 -1.064608 -1.074857
25%   -1.076736 -0.898739 -0.653578 -0.681774
50%   -0.537047 -0.230640  0.180444  0.087568
75%   -0.020580  0.678584  0.642688  0.736786
max    0.547917  1.143628  1.179651  1.268746

In [12]:
df.T # 转置

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.118245    0.547917   -1.394952   -0.952208   -0.121886    0.013189
B   -0.858175    0.772481   -1.227015    0.396895    1.143628   -0.912261
C    0.772255   -1.064608   -0.907070    0.106899    1.179651    0.253989
D    0.480990    1.268746    0.822052   -1.074857   -0.807081   -0.305855

In [13]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.480990  0.772255 -0.858175 -1.118245
2013-01-02  1.268746 -1.064608  0.772481  0.547917
2013-01-03  0.822052 -0.907070 -1.227015 -1.394952
2013-01-04 -1.074857  0.106899  0.396895 -0.952208
2013-01-05 -0.807081  1.179651  1.143628 -0.121886
2013-01-06 -0.305855  0.253989 -0.912261  0.013189

In [14]:
df.sort_values(by='C') # 对排序

                   A         B         C         D
2013-01-02  0.547917  0.772481 -1.064608  1.268746
2013-01-03 -1.394952 -1.227015 -0.907070  0.822052
2013-01-04 -0.952208  0.396895  0.106899 -1.074857
2013-01-06  0.013189 -0.912261  0.253989 -0.305855
2013-01-01 -1.118245 -0.858175  0.772255  0.480990
2013-01-05 -0.121886  1.143628  1.179651 -0.807081

In [15]:
df['A']

2013-01-01   -1.118245
2013-01-02    0.547917
2013-01-03   -1.394952
2013-01-04   -0.952208
2013-01-05   -0.121886
2013-01-06    0.013189
Freq: D, Name: A, dtype: float64

用 [ ] 切片行：

In [16]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.118245 -0.858175  0.772255  0.480990
2013-01-02  0.547917  0.772481 -1.064608  1.268746
2013-01-03 -1.394952 -1.227015 -0.907070  0.822052

In [17]:
df['2013-01-01':'2013-01-03']

                   A         B         C         D
2013-01-01 -1.118245 -0.858175  0.772255  0.480990
2013-01-02  0.547917  0.772481 -1.064608  1.268746
2013-01-03 -1.394952 -1.227015 -0.907070  0.822052

In [18]:
df.loc[dates[0]]

A   -1.118245
B   -0.858175
C    0.772255
D    0.480990
Name: 2013-01-01 00:00:00, dtype: float64

In [19]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01 -1.118245 -0.858175
2013-01-02  0.547917  0.772481
2013-01-03 -1.394952 -1.227015
2013-01-04 -0.952208  0.396895
2013-01-05 -0.121886  1.143628
2013-01-06  0.013189 -0.912261

In [20]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  0.547917  0.772481
2013-01-03 -1.394952 -1.227015
2013-01-04 -0.952208  0.396895

In [21]:
df.loc[:,'A']

2013-01-01   -1.118245
2013-01-02    0.547917
2013-01-03   -1.394952
2013-01-04   -0.952208
2013-01-05   -0.121886
2013-01-06    0.013189
Freq: D, Name: A, dtype: float64

# 按位置选择

In [22]:
df.iloc[3]

A   -0.952208
B    0.396895
C    0.106899
D   -1.074857
Name: 2013-01-04 00:00:00, dtype: float64

In [23]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.952208  0.396895
2013-01-05 -0.121886  1.143628

In [24]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.547917 -1.064608
2013-01-03 -1.394952 -0.907070
2013-01-05 -0.121886  1.179651

# 布尔索引

In [25]:
df[df.A > 0]

                   A         B         C         D
2013-01-02  0.547917  0.772481 -1.064608  1.268746
2013-01-06  0.013189 -0.912261  0.253989 -0.305855

In [26]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN  0.772255  0.480990
2013-01-02  0.547917  0.772481       NaN  1.268746
2013-01-03       NaN       NaN       NaN  0.822052
2013-01-04       NaN  0.396895  0.106899       NaN
2013-01-05       NaN  1.143628  1.179651       NaN
2013-01-06  0.013189       NaN  0.253989       NaN

In [27]:
df2 = df.copy()

In [28]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [29]:
df2

                   A         B         C         D      E
2013-01-01 -1.118245 -0.858175  0.772255  0.480990    one
2013-01-02  0.547917  0.772481 -1.064608  1.268746    one
2013-01-03 -1.394952 -1.227015 -0.907070  0.822052    two
2013-01-04 -0.952208  0.396895  0.106899 -1.074857  three
2013-01-05 -0.121886  1.143628  1.179651 -0.807081   four
2013-01-06  0.013189 -0.912261  0.253989 -0.305855  three

In [30]:
 df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -1.394952 -1.227015 -0.907070  0.822052   two
2013-01-05 -0.121886  1.143628  1.179651 -0.807081  four

# 赋值

In [31]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20191226', periods=6))
s1

2019-12-26    1
2019-12-27    2
2019-12-28    3
2019-12-29    4
2019-12-30    5
2019-12-31    6
Freq: D, dtype: int64

In [32]:
df.at[dates[0], 'A'] = 0

In [33]:
df.iat[0, 1] = 0

In [34]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [35]:
df

                   A         B         C  D
2013-01-01  0.000000  0.000000  0.772255  5
2013-01-02  0.547917  0.772481 -1.064608  5
2013-01-03 -1.394952 -1.227015 -0.907070  5
2013-01-04 -0.952208  0.396895  0.106899  5
2013-01-05 -0.121886  1.143628  1.179651  5
2013-01-06  0.013189 -0.912261  0.253989  5

用 where 条件赋值：

In [36]:
df2 = df.copy()

In [37]:
df2[df2 > 0] = -df2

In [38]:
df2

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.772255 -5
2013-01-02 -0.547917 -0.772481 -1.064608 -5
2013-01-03 -1.394952 -1.227015 -0.907070 -5
2013-01-04 -0.952208 -0.396895 -0.106899 -5
2013-01-05 -0.121886 -1.143628 -1.179651 -5
2013-01-06 -0.013189 -0.912261 -0.253989 -5

# 缺失值

重建索引（reindex）可以更改、添加、删除指定轴的索引，并返回数据副本，即不更改原数据

In [39]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  0.772255  5  1.0
2013-01-02  0.547917  0.772481 -1.064608  5  1.0
2013-01-03 -1.394952 -1.227015 -0.907070  5  NaN
2013-01-04 -0.952208  0.396895  0.106899  5  NaN

删除所有含缺失值的行：

In [40]:
df1.dropna(how='any')

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  0.772255  5  1.0
2013-01-02  0.547917  0.772481 -1.064608  5  1.0

In [ ]:
填充缺失值：

In [41]:
df1.fillna(value=5)

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  0.772255  5  1.0
2013-01-02  0.547917  0.772481 -1.064608  5  1.0
2013-01-03 -1.394952 -1.227015 -0.907070  5  5.0
2013-01-04 -0.952208  0.396895  0.106899  5  5.0

提取 nan 值的布尔掩码：

In [42]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

# 运算

## 统计

一般情况下，运算时排除缺失值。

In [43]:
df.mean()

A   -0.317990
B    0.028955
C    0.056853
D    5.000000
dtype: float64

In [45]:
df.mean(1) # 在另一个轴(即，行)上执行同样的操作：

2013-01-01    1.443064
2013-01-02    1.313947
2013-01-03    0.367741
2013-01-04    1.137896
2013-01-05    1.800348
2013-01-06    1.088729
Freq: D, dtype: float64

不同维度对象运算时，要先对齐。 此外，Pandas 自动沿指定维度广播。

## 直方图

In [57]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    0
1    1
2    5
3    3
4    5
5    4
6    2
7    4
8    6
9    1
dtype: int32

In [58]:
s.value_counts()

5    2
4    2
1    2
6    1
3    1
2    1
0    1
dtype: int64

# 合并（Merge）